Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.4.68/samd20b/edc/ATSAMD20E14B.PIC
      <edc:AdjustPoint edc:_addr="0x40000826" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x40000828" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFLLVAL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SYSCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:SFRFieldDef edc:cname="FINE" edc:desc="Fine Calibration Value" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="COARSE" edc:desc="Coarse Calibration Value" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="DIFF" edc:desc="Multiplication Ratio Difference" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000082C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFLLMUL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SYSCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:SFRFieldDef edc:cname="MUL" edc:desc="Multiplication Value" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="FSTEP" edc:desc="Maximum Fine Step Size" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CSTEP" edc:desc="Maximum Coarse Step Size" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000830" edc:access="n-------" edc:cname="DFLLSYNC" edc:impl="0x80" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SYSCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="READREQ" edc:desc="Read Request Synchronization" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000831" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40000834" edc:access="----------nnnnnnnnnn--nn-n-nnnn-" edc:cname="BOD33" edc:impl="0x3FF35E" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SYSCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HYST" edc:desc="Hysteresis Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:desc="Action when Threshold Crossed" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="The BODVDD generates a reset" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="INT" edc:desc="The BODVDD generates an interrupt" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run during Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Operation Modes" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CEN" edc:desc="Clock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PSEL" edc:desc="Prescaler Select" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide clock by 2" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide clock by 4" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide clock by 8" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide clock by 16" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide clock by 32" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide clock by 64" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide clock by 128" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide clock by 256" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="Divide clock by 512" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide clock by 1024" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="DIV2048" edc:desc="Divide clock by 2048" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="DIV4096" edc:desc="Divide clock by 4096" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="DIV8192" edc:desc="Divide clock by 8192" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="DIV16384" edc:desc="Divide clock by 16384" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="DIV32768" edc:desc="Divide clock by 32768" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="DIV65536" edc:desc="Divide clock by 65536" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL" edc:desc="Threshold Level" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000838" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4000083C" edc:access="--n------n------" edc:cname="VREG" edc:impl="0x2040" edc:mclr="0000010000000010" edc:nzwidth="0x10" edc:por="0000010000000010" ltx:memberofperipheral="SYSCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run during Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="FORCELDO" edc:desc="Force LDO Voltage Regulator" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000083E" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x40000840" edc:access="-----nnnnnnnnnnn-------------nn-" edc:cname="VREF" edc:impl="0x7FF0006" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SYSCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TSEN" edc:desc="Temperature Sensor Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BGOUTEN" edc:desc="Bandgap Output Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="CALIB" edc:desc="Voltage Reference Calibration Value" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000844" edc:offset="0x3BC"/>
      <edc:SFRDef edc:_addr="0x40000C00" edc:access="-------n" edc:cname="CTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000C01" edc:access="r-------" edc:cname="STATUS" edc:impl="0x80" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SYNCBUSY" edc:desc="Synchronization Busy Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000C02" edc:access="nn--nnnn--nnnnnn" edc:cname="CLKCTRL" edc:impl="0xCF3F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="ID" edc:desc="Generic Clock Selection ID" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:cname="DFLL48M" edc:desc="DFLL48M Reference" edc:when="(field &amp; 0x3F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="WDT" edc:desc="WDT" edc:when="(field &amp; 0x3F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RTC" edc:desc="RTC" edc:when="(field &amp; 0x3F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EIC" edc:desc="EIC" edc:when="(field &amp; 0x3F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_0" edc:desc="EVSYS_CHANNEL_0" edc:when="(field &amp; 0x3F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_1" edc:desc="EVSYS_CHANNEL_1" edc:when="(field &amp; 0x3F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_2" edc:desc="EVSYS_CHANNEL_2" edc:when="(field &amp; 0x3F) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_3" edc:desc="EVSYS_CHANNEL_3" edc:when="(field &amp; 0x3F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_4" edc:desc="EVSYS_CHANNEL_4" edc:when="(field &amp; 0x3F) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_5" edc:desc="EVSYS_CHANNEL_5" edc:when="(field &amp; 0x3F) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_6" edc:desc="EVSYS_CHANNEL_6" edc:when="(field &amp; 0x3F) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_CHANNEL_7" edc:desc="EVSYS_CHANNEL_7" edc:when="(field &amp; 0x3F) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="SERCOMX_SLOW" edc:desc="SERCOMx_SLOW" edc:when="(field &amp; 0x3F) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM0_CORE" edc:desc="SERCOM0_CORE" edc:when="(field &amp; 0x3F) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM1_CORE" edc:desc="SERCOM1_CORE" edc:when="(field &amp; 0x3F) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM2_CORE" edc:desc="SERCOM2_CORE" edc:when="(field &amp; 0x3F) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM3_CORE" edc:desc="SERCOM3_CORE" edc:when="(field &amp; 0x3F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM4_CORE" edc:desc="SERCOM4_CORE" edc:when="(field &amp; 0x3F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM5_CORE" edc:desc="SERCOM5_CORE" edc:when="(field &amp; 0x3F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="TC0_TC1" edc:desc="TC0,TC1" edc:when="(field &amp; 0x3F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="TC2_TC3" edc:desc="TC2,TC3" edc:when="(field &amp; 0x3F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="TC4_TC5" edc:desc="TC4,TC5" edc:when="(field &amp; 0x3F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="TC6_TC7" edc:desc="TC6,TC7" edc:when="(field &amp; 0x3F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="ADC" edc:desc="ADC" edc:when="(field &amp; 0x3F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="AC_DIG" edc:desc="AC_DIG" edc:when="(field &amp; 0x3F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="AC_ANA" edc:desc="AC_ANA" edc:when="(field &amp; 0x3F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC" edc:when="(field &amp; 0x3F) == 0x1A"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GEN" edc:desc="Generic Clock Generator" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CLKEN" edc:desc="Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000C04" edc:access="----------nnnnnn---nnnnn----nnnn" edc:cname="GENCTRL" edc:impl="0x3F1F0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="ID" edc:desc="Generic Clock Generator Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SRC" edc:desc="Source Select" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC oscillator output" edc:when="(field &amp; 0x1F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLKIN" edc:desc="Generator input pad" edc:when="(field &amp; 0x1F) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLKGEN1" edc:desc="Generic clock generator 1 output" edc:when="(field &amp; 0x1F) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="OSCULP32K oscillator output" edc:when="(field &amp; 0x1F) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="OSC32K oscillator output" edc:when="(field &amp; 0x1F) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K oscillator output" edc:when="(field &amp; 0x1F) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OSC8M" edc:desc="OSC8M oscillator output" edc:when="(field &amp; 0x1F) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DFLL48M" edc:desc="DFLL48M output" edc:when="(field &amp; 0x1F) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="GENEN" edc:desc="Generic Clock Generator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDC" edc:desc="Improve Duty Cycle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OOV" edc:desc="Output Off Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIVSEL" edc:desc="Divide Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide input directly by divider factor" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide input by 2^(divider factor+ 1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000C08" edc:access="--------nnnnnnnnnnnnnnnn----nnnn" edc:cname="GENDIV" edc:impl="0xFFFF0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="ID" edc:desc="Generic Clock Generator Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Division Factor" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000C0C" edc:offset="0x3F4"/>
      <edc:SFRDef edc:_addr="0x40001000" edc:access="n----nn-" edc:cname="CTRL" edc:impl="0x86" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WEN" edc:desc="Watchdog Timer Window Mode Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ALWAYSON" edc:desc="Always-On" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001001" edc:access="nnnnnnnn" edc:cname="CONFIG" edc:mclr="10111011" edc:nzwidth="0x8" edc:por="10111011" ltx:memberofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Time-Out Period" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 clock cycles" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 clock cycles" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 clock cycles" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 clock cycles" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="128" edc:desc="128 clock cycles" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="256" edc:desc="256 clock cycles" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="512" edc:desc="512 clock cycles" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="1K" edc:desc="1024 clock cycles" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="2K" edc:desc="2048 clock cycles" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="4K" edc:desc="4096 clock cycles" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="8K" edc:desc="8192 clock cycles" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="16K" edc:desc="16384 clock cycles" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WINDOW" edc:desc="Window Mode Time-Out Period" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 clock cycles" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 clock cycles" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 clock cycles" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 clock cycles" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="128" edc:desc="128 clock cycles" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="256" edc:desc="256 clock cycles" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="512" edc:desc="512 clock cycles" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="1K" edc:desc="1024 clock cycles" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="2K" edc:desc="2048 clock cycles" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="4K" edc:desc="4096 clock cycles" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="8K" edc:desc="8192 clock cycles" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="16K" edc:desc="16384 clock cycles" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
